tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"
tap "tkareine/chnode"
brew "bottom"
brew "chruby"
brew "cmark-gfm"
brew "duf"
brew "openssl@3"
brew "eza"
brew "fzf"
brew "gh"
brew "glow"
brew "iperf3"
brew "jq"
brew "mandown"
brew "mdp"
brew "micro"
brew "mtr"
brew "node-build"
brew "rustup-init"
brew "shellcheck"
brew "sqlite"
brew "tmux"
brew "wget"
brew "xh"
brew "zsh-completions"
brew "teamookla/speedtest/speedtest"
brew "tkareine/chnode/chnode"
cask "1password-cli"
cask "devtunnel"
cask "emacs"
cask "font-computer-modern"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-intel-one-mono"
cask "font-monaspace"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "netnewswire"
cask "obs"
cask "vlc"
cask "xquartz"
cask "xscope"
