# Tools
brew "age"
brew "age-plugin-yubikey"
brew "btop"
brew "cmark-gfm"
brew "eza"
brew "gh"
brew "htop"
brew "jq"
brew "nvtop"
brew "ripgrep"
brew "serie"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
brew "yq"

# Developer tools
brew "golang"
brew "just"
brew "rustup"

# Editors
brew "helix"

if OS.mac?
  brew "gnupg"
  brew "pinentry"
  brew "pinentry-mac"
  brew "ykman"
  brew "yubico-piv-tool"

  cask_args adopt: true
  cask "bbedit"
  cask "chatgpt"
  cask "github"
  cask "ghostty"
  cask "hhkb"
  cask "netnewswire"
  cask "proton-drive"
  cask "proton-mail"
  cask "proton-mail-bridge"
  cask "proton-pass"
  cask "protonvpn"
  cask "signal"
  cask "tailscale-app"
  cask "vivaldi"
  cask "visual-studio-code"
  cask "xquartz"
  cask "xscope"
  cask "yubico-authenticator"

  # My extras
  tap "ascarter/extras"
  brew "ascarter/extras/sk-libfido2"

  # 3rd party utilities
  tap "teamookla/speedtest"
  brew "teamookla/speedtest/speedtest"

  # tap "dagger/tap"
  # cask "container-use"
elsif OS.linux?
  # ...
end
