tap "homebrew/cask-fonts"
tap "microsoft/git"
tap "teamookla/speedtest"

brew "chruby"
brew "cmark-gfm"
brew "duf"
brew "eza"
brew "gh"
brew "glow"
brew "htop"
brew "iperf3"
brew "jq"
brew "mandown"
brew "mdp"
brew "micro"
brew "neovim"
brew "rustup-init"
brew "sqlite"
brew "tmux"
brew "zsh-completions"

brew "teamookla/speedtest/speedtest"

cask "1password-cli"
cask "devtunnel"
cask "git-credential-manager"
cask "github"
cask "macvim"
cask "netnewswire"
cask "obsidian"
cask "postico"
cask "postman-cli"
cask "postman"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "xscope"

cask "font-computer-modern"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-intel-mono-one"
cask "font-monaspace"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
