tap "microsoft/git"
tap "teamookla/speedtest"

brew "chruby"
brew "cmark-gfm"
brew "duf"
brew "eza"
brew "gh"
brew "glow"
brew "htop"
brew "iperf3"
brew "jq"
brew "mandown"
brew "mdp"
brew "micro"
brew "neovim"
brew "rustup-init"
brew "sqlite"
brew "tmux"
brew "zsh-completions"

brew "teamookla/speedtest/speedtest"

cask "1password-cli"
cask "devtunnel"
cask "git-credential-manager"
cask "postman-cli"
