# Homebrew Brewfile — macOS host packages
#
# Used by: dotfiles host init (brew bundle --file)
# Contains: host-integrated apps, OS utilities, and package manager prerequisites.
# CLI tools that work cross-platform belong in aqua config instead.

# Host utilities
brew "age"
brew "age-plugin-yubikey"
brew "btop"
brew "cmark-gfm"
brew "htop"
brew "nvtop"
brew "sqlite"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"

# Package managers
brew "aqua"

# Security
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
brew "ykman"
brew "yubico-piv-tool"

# macOS apps
cask_args adopt: true
cask "bbedit"
cask "chatgpt"
cask "claude"
cask "codex-app"
cask "discord"
cask "github"
cask "ghostty"
cask "hhkb"
cask "keepassxc"
cask "logi-options+"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-pass"
cask "protonvpn"
cask "signal"
cask "tailscale-app"
cask "vivaldi"
cask "visual-studio-code"
cask "xquartz"
cask "xscope"
cask "yubico-authenticator"

# 3rd party
tap "teamookla/speedtest"
brew "teamookla/speedtest/speedtest"
