tap "homebrew/bundle"
brew "alpine"
brew "autoconf"
brew "btop"
brew "cmark-gfm"
brew "cosign"
brew "eza"
brew "fastfetch"
brew "gh"
brew "git-lfs"
brew "gitu"
brew "gitui"
brew "gmp"
brew "gnupg"
brew "go"
brew "helix"
brew "htop"
brew "jq"
brew "libyaml"
brew "marksman"
brew "openssl@3"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "slsa-verifier"
brew "sqlite"
brew "stockfish"
brew "taplo"
brew "tlrc"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
brew "yq"
